{"meta":{"title":"Xiaohuang2's Math World","subtitle":"Math is a kind of belief.","description":"I only like math, coding, home and her.","author":"xiaohuang2","url":"https://example.com","root":"/"},"pages":[{"title":"关于","date":"2022-05-15T06:35:37.974Z","updated":"2022-05-15T06:35:37.974Z","comments":true,"path":"about/index.html","permalink":"https://example.com/about/index.html","excerpt":"","text":"I like math. I like coding. I like Minecraft. I like my family. I like her. And I want to record them. So I made this blog. No need to know who I am and contact me. We only need to be ourselves and struggle forever."},{"title":"归档","date":"2022-04-10T04:55:24.000Z","updated":"2022-05-04T08:18:40.152Z","comments":true,"path":"archives/index.html","permalink":"https://example.com/archives/index.html","excerpt":"","text":""},{"title":"分类","date":"2022-05-04T08:19:13.886Z","updated":"2022-05-04T08:19:13.886Z","comments":true,"path":"categories/index.html","permalink":"https://example.com/categories/index.html","excerpt":"","text":""},{"title":"友链","date":"2022-05-15T06:33:36.929Z","updated":"2022-05-15T06:33:36.929Z","comments":true,"path":"links/index.html","permalink":"https://example.com/links/index.html","excerpt":"","text":""},{"title":"search","date":"2022-05-04T02:40:50.000Z","updated":"2022-05-04T03:55:07.784Z","comments":true,"path":"search/index.html","permalink":"https://example.com/search/index.html","excerpt":"","text":""},{"title":"标签","date":"2022-05-15T06:33:26.814Z","updated":"2022-05-15T06:33:26.814Z","comments":true,"path":"tags/index.html","permalink":"https://example.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"汇总中学阶段所有类型的函数（一）","slug":"汇总中学阶段截至高中必修二所有类型函数","date":"2022-05-08T01:36:35.000Z","updated":"2022-05-15T06:38:02.704Z","comments":true,"path":"2022/05/08/hui-zong-zhong-xue-jie-duan-jie-zhi-gao-zhong-bi-xiu-er-suo-you-lei-xing-han-shu/","link":"","permalink":"https://example.com/2022/05/08/hui-zong-zhong-xue-jie-duan-jie-zhi-gao-zhong-bi-xiu-er-suo-you-lei-xing-han-shu/","excerpt":"声明：博主学习的高中数学书是 B 版，必修册数和 A 版不一样而已，内容应该没有太大差别 函数是我们入门数学的标志，从初二的一次函数，到高中的三角函数。本文我将尽量用自己的理解和通俗的语言总结中学阶段的所有函数。由于我还没有学到三角函数，就暂且先放着，待我学成归来再更新这篇文章。","text":"声明：博主学习的高中数学书是 B 版，必修册数和 A 版不一样而已，内容应该没有太大差别 函数是我们入门数学的标志，从初二的一次函数，到高中的三角函数。本文我将尽量用自己的理解和通俗的语言总结中学阶段的所有函数。由于我还没有学到三角函数，就暂且先放着，待我学成归来再更新这篇文章。 一、一次函数1、基本定义与性质顾名思义，一次函数即为 $x$ 的最高次项为一次。一般形式为 $y=kx+b$ 。 那么，斜率 $k$ 与常数 $b$ 和一次函数的图像有什么关系呢？我们来研究研究。 首先，明确正比例函数的概念，是形如 $y=kx$ 的函数（即 $b=0$）。 我们在上一篇讲函数增减的文章中提到过了，它的图像是经过原点的（$x=0$ 时，$k$ 取多少 $y$ 都为 $0$）。 给正比例函数加上 $b$ 之后，这个 $b$ 加给谁了呢，当然是加给 $y$ 了，即将原来的 $y=kx$ 图像进行上下方向的移动。看下面的图更直观。 那么，我们就可以讨论 $k$ 和 $b$ 的取值与直线经过象限的关系了。真的不用死记，理解了随时都可以想象出来。 $k&gt;0$ 时，$y=kx$ 是增函数，穿过一、三象限，请试着在脑海中想象图像。然后再讨论 $b$ 的取值。 $b&gt;0$ 时，就把图像往上平移，即穿过一、二、三象限； $b&lt;0$ 时，就把图像往下平移，即穿过一、三、四象限。 同理， $k0$ 时，就把图像往上平移，即穿过一、二、四象限； $b&lt;0$ 时，就把图像往下平移，即穿过二、三、四象限。 2、常见用法或考法a.两直线垂直时， $k$ 值的积为 -1该结论现在还不好证明，但我们可以通过简单情况来探讨。 既然 $b$ 的取值只影响图像的平移，那么图像的斜率仍由 $k$ 控制。 上图红线为 $y=3x$ ， 蓝线为 $y=-\\frac{1}{3}x$ ， 橙线为 $y=\\frac{1}{3}x$（用来辅助我们思考的）。 不难看出，两直线垂直时， $k$ 值的积确实为 -1 b.已知两直线解析式，求两直线交点这个很好说，因为此时交点坐标同时满足两条直线的解析式，只需代入然后解二元一次方程组即可。 二次函数1、基本定义与性质二次函数即为自变量最高次项为二次。 值得注意的是，二次函数有两种表现形式。 一般形式： y=ax^2+bx+c还有一种我们叫标准式（也叫顶点式）： y=a(x-h)^2+k先说标准式的图像特点： $a&gt;0$ 时，图像开口向上， $a&lt;0$ 时，图像开口向下。 对称轴是 $x=h$ 。 顶点是 $(h, k)$ 。 放张图： 如图，红色为 $y=-(x+1)^2+3$ 的图像，此时 $a=-1, h=-1, k=3$ ，开口向下，对称轴是 $x=-1$ ，顶点是 $(-1, 3)$ 。 另一条图像为 $y=2(x-2)^2-1$ ，同理可推出相关信息。 再来看看一般式的特点： 同样，$a$ 的大小决定开口，不多说了。 对称轴为 $x=-\\frac{b}{2a}$ 。 顶点为 $(-\\frac{b}{2a},\\frac{4ac-b^2}{4a})$ 。 图就算了。 一般式的特点也来自于标准式的配方结果。 $ \\large y=ax^2+bx+c \\\\\\quad=a(x^2+\\frac{b}{a}x+\\frac{c}{a}) \\\\\\quad=a(x^2+\\frac{b}{a}x+\\frac{b^2}{4a^2}+\\frac{c}{a}-\\frac{b^2}{4a^2})\\\\\\quad=a(x+\\frac{b}{2a})^2+\\frac{4ac-b^2}{4a}$ 看，这不就变成标准式了？ 至于二次函数与一元二次方程的关系。。。 也比较简单，不想打字了。。。 高中会引出一个概念叫“零点”，是指函数图像与 x 轴的交点。 也就是说，二次函数的零点的横坐标就是对应的一元二次方程的根。 2、常见用法或考法a.已知三点坐标，求函数解析式先设解析式为 $y=ax^2+bx+c$ ，然后把三点坐标分别代入并解三元一次方程组即可。 b.二次函数的运动我还是不放心读者对二次函数在平面上运动的理解，这里的运动包括平移和开口的大小变化。 最主要的就是把解析式转换为标准式，然后分析。直接放动图吧： 解析式为 $y=a(x-h)^2+k$ ，一开始默认 a, h, k 的值都为 1 。然后分别将三个值逐渐变大再变小。 a 由 1 逐渐变大再变小： h 由 1 逐渐变大再变小： k 由 1 逐渐变大再变小： 后两张图不小心把下面输入值的那一栏也录进来了，将就着看吧。 c.二次函数的最值问题因为二次函数图像有顶点，所以很多题目常涉及到最值问题。 这里拿必修一的一题举一个例子。 哎呀，必修一的书暂时不在我手上。。。 那行，先写到这，等我把书拿到了再更新这道题。 反比例函数待续。。。","categories":[{"name":"数学","slug":"数学","permalink":"https://example.com/categories/%E6%95%B0%E5%AD%A6/"}],"tags":[{"name":"函数","slug":"函数","permalink":"https://example.com/tags/%E5%87%BD%E6%95%B0/"},{"name":"初中","slug":"初中","permalink":"https://example.com/tags/%E5%88%9D%E4%B8%AD/"}]},{"title":"我和 ta","slug":"我和ta","date":"2022-05-06T22:15:33.000Z","updated":"2022-05-17T13:57:58.591Z","comments":true,"path":"2022/05/07/wo-he-ta/","link":"","permalink":"https://example.com/2022/05/07/wo-he-ta/","excerpt":"前言我曾经有过很多同桌，但唯独 ta 没法让我忘记。从小到大，我只为换同桌哭过两次，第一次是在小学，一个好哥们；第二次就是 ta 了。 没法忘了 ta ，只能把故事和情感记录、倾诉在博客上了。","text":"前言我曾经有过很多同桌，但唯独 ta 没法让我忘记。从小到大，我只为换同桌哭过两次，第一次是在小学，一个好哥们；第二次就是 ta 了。 没法忘了 ta ，只能把故事和情感记录、倾诉在博客上了。 正文5.7 早上6:20左右更：ta 啊， ta 是女的。 ta 是我上一任同桌呢。。。 不过，换座位了。 班主任自己编排的一份座位表。 换座位是在前天，下午来上学时。 我帮她把椅子都从座位上搬下来了，她来时还惊讶：“哎呀，谁帮我把椅子搬下来了？” To be frank，她真的挺好。 换座位那天晚上睡觉，我躲在被窝里哭了半天才慢慢睡着。 我就是想到之前做同桌时的点点滴滴，又想到再也不可能做回同桌，眼泪就止不住地往下掉。 我想起和她音乐课一起被点起来唱歌； 想起晚托和她用草稿纸聊天； 想起有一回听讲座让我们写下自己的愿望，她写的要永远和我做同桌； 想起期中考试完她考差了坐在我旁边哭鼻子，我也只能给她递两张纸擦擦眼泪； 想起上课时她偷看我，我又偷看她； 想起我许诺给她补补理科，她后来还提醒我不要反悔，可现在却没法实现了； 想起换座位之前她抓着我的胳膊，最后依依不舍地说拜拜； 想起分开后她下课仍然常常找我说两句话，而我感觉有很多话说却一个字都吐不出来； 想起前天晚上的梦，整夜梦到的都是她； 又想起昨晚的梦，她喜欢别人去了，我只能在一旁看着，醒来后一边感叹还好这不是真的，一边哭着告诉自己再也不要做这种梦。。。 想起好多，想到好多，也都想和她说，却开不了口。 真是奇怪，只是对她有点好感而已，却把我自己变得那么矫情。 （5.9晚上更改）她说了，“有点”好感还不够。得，我还得热烈一点。 啊啊啊爱死你了宝贝儿！ 以后写一篇叫一声宝贝儿行了吧。 哼。 非得我把所有情感表达出来给你看是嘛。 5.8 早上8:35左右更：我觉得，没必要这么难过。 如果真的是真情，那么即使不再是同桌，也是能很好地相处的。 她昨天下午往我抽屉里丢了个东西，是做眼保健操时我正好闭着眼。她告诉我不要拿出来看，回去再拆。哈哈，她还挺可爱的。 “不要在学校拿出来看啊，回去再看。” 我不说话。 “听到没有？” 我还不说话。 “点头，快点。” 我重重地点了两下头。 她这才满意了。 回家看了，一个小盒子，上面贴了张纸条。 “那个猫的尾巴断了，你不会介意的吧？” 怪不得昨天她老在问我如果一个人给你送东西但是那个东西断了一块你会不会介意，原来是这意思啊。 我打开盒子，里面真有只小猫。好像可以专门摆在什么地方，但是我还不会玩，只能上学再问了。 我拿起笔，在那张纸条上写了两句。 “当然不介意啦，毕竟你是谁啊，是我最好的同桌啊！永远都是！” 写完，我便把这小猫连同盒子一起放进书桌的柜子里，收藏起来。 昨天晚上放学，老师嚷嚷着让我们快些走，说马上下暴雨了（其实后来一滴雨也没掉）。她有伞，问我要不要，我说不用。她先走了。 我还在收书包，她却转回来了，又问我是不是真的不要伞，我说真不用。她又走了。 我刚刚背上书包时，她又转回来了，说我怎么这么慢。 “这么慢，都要下雨啦！” “你等我干嘛？”我想看看她的反应。 “对呀，你等他干嘛？”周围几个男生也朝着她问道。 她没说话。 我和几个男生走出教室门，她还在门外面。 “走啦走啦。”我说。 几个男生好像察觉出什么，纷纷开始起哄。“哦~”的声音此起彼伏。 “哦什么哦！”我朝那几个人喊。 而她听到后，已经飞一般跑走了。 “不要随便造谣啊。”我跟那几个男生说。 事情到这就先告一段落了。 其实，我的几个好兄弟不会怎么管我这事儿的。懂的都懂。 顶多起两句哄。 哎呀，写到这，我都忍不住笑了。 还有差不多一年左右的时间，初中就毕业了。 后悔没有早点认识她。 好吧，就先到这儿。挺开心的。 5.9 早上6:07左右更：昨晚和她在操场碰见。她作业还没写完就来了（来找我的嘿嘿）。 走了一圈又一圈，聊了很多天。不过基本都是她在讲。 我把博客推给她了，让她可以回去看看。 哦对，她说，和我一起走的时候很尴尬。 也不知道她什么意思（有点好感吧可能）。 最后还被送了一瓶吃的。 她还有话憋着没说出来，不过我会等着。 毕竟我也总有话憋着说不出来。 小宝贝儿。 5.9 晚上19:58左右更：昨天不是把博客推给她了嘛。 然后她肯定看了。 今天晚上放学竟然问我记不记得第一篇结尾怎么写的，还特别提醒这是道送命题。 说实话我真忘了。。。 她有点小生气。 啧。 但我是真忘了啊。 再写两张小纸片儿吧。 不好开口。 哦还有，本来今天要给张小纸片的，一直放在文具盒里，被别人发现了。还好我眼疾手快抢回来了。可惜纸烂了要再写一张。 她肯定是看了我写的东西，今天心情还不错。 啊当然是在晚上放学前。 每次她用一种。。。怎么形容好呢。。。一种小公主的语气和我讲话时，我心里总是莫名地甜滋滋的。 嗯。 她容易闹小脾气。 我不介意。 只要在法律范围内，她做什么，我都不会生气的，她说什么，我都会试着做的。 像她今天让我把衣服扎到裤子里去。。。 我也不知道她要干嘛。 行吧，去了趟厕所扎好了。 然后有点不舒服。。。 她说扎着挺好看的。 毕竟， 要么就永远没认识过她， 但现在认识了，混熟了，就离不开她了。 满脑子都是她。 不会还在生气吧宝贝儿。 5.10 晚上19:53左右更：她说，别再用那个称呼。 哼，不用就不用，但我在心里还这么叫（反正她也听不到）。 之前的文章里面的称呼我可不删，要留着纪念的。 她还是容易闹小脾气。 我随便干点什么事儿她都能找出毛病然后讽刺我一番然后不高兴。。。 不过这小脾气来得快去得也快。 我并不烦她的这些小情绪，反之，如果没这些小情绪，那会很平淡的。 她上课喜欢偷瞄我，今天有一回被我发现了。 真是继承了我的优良传统。 哈哈。 我不是很会讲话。跟她也只有单独在一起时才能说两句话出口。 她也许正在看我写的东西。。。 并且看到这句时肯定笑了。。。 是吧宝。。。我是说，同桌？ 行行行，放心里叫。 真是，不做同桌了，她讲句话我都听不到了，隔太远了。 嗯。。。现在还算坐得比较近，我生怕之后再换被换成千里之隔了。 很不是滋味儿。 不开心。 算了，从现在开始多想想她吧。 想着想着就开心了呢。❤️ 5.11 晚上20:03左右更：她今天不知道遭遇了什么，突然写了段话给我。 内容。。。 是有关我和她的关系的。。。 我想了想自己好像也没做错事啊。 应该是有人说闲话吧。 中午回家我就在思考，是时候呼叫超级飞侠发挥我作为男生的英雄气概了。 便就在那纸条上回了几句。 其实别人的看法真不重要。 她还谈名声，谈脸面，我就感觉很怪。 她不是这种人啊。 她可是我的宝。。。不是，我的同桌啊。 不应该把情感放在他人眼光里衡量的。 我只是希望她和我在一起时能开开心心的。 如果能共同在成绩上进步，那再好不过了。那样我们再怎么 close 都不会有人管了。这叫“模范情侣”。 她肯定能考上荆州中学的。 毕竟是我的宝。。。我的同桌嘛。 哎呀还是忍不住这么叫。 反正我不管，就是喜欢她。 至于她怎么选择，那我也没办法。 突然想起来前天晚上做梦，我俩的手牵得好紧。。。 离中考也不远了，也就一年多了。 嘿，宝贝儿听好了。 华师一我考上了也不去，宝贝儿一定要中考考好点，我们一起去上荆中哦！ 一言为定，不许反悔！ 说好啦！ 哦对今天凌晨我写了纸条在口袋里揣一天了都没给。 明天给啊，不过有些话都过期了。 希望看到你每天脸上都挂着笑！ （ps：上课好像不怎么看我了。。。） 5.12 晚上20:19左右更：md 纸条又在口袋里揣了一天。 真是，哪有像我这样的，一男生还扭扭捏捏的。 要是一直这样又能有什么结果呢。 我会努力试着慢慢改变的。 仔细想想昨天的事，那段话，还是有些没法理解。 嗯，我挺喜欢她的。 至于她和他怎么办，那要看她怎么选了。 尊重她的选择。 我只想天天看着她开心，这就够了。 没别的愿望了。 真的。 是的，我喜欢她，她又喜欢他，没有比这更悲哀的了吧。 在这种日复一日的两点一线的生活中，除了家和她，还有什么值得我拼了命地付出呢？ 哦，她会看到我写的东西的。 希望她别有太多负担。 还有，请在学校的时候多和我说说话吧。 多对我笑两下。 至少不让我太消极吧。 有点抱歉，不该打扰人家的。 我常常问我自己，哪一点比不上他。以至于她一直记着他。 算了，气氛别搞坏了。 我会坚持的，希望她能多体谅我，能理解我有时说不出话、做不出行动的一副蠢样。 能包容我的糊涂一时，能包容我不小心做错的事，能多对我笑，能多和我说话，虽然我暂时并没有能力去付出相应的东西。 但心里那份喜欢，是真的啊。真到足以让我一个人是哭起来，真到能让我时不时发呆，真到我忘了边上的一切。 她总是提醒我不要发呆，可她不一定知道，也许我正在想她呢。。。 剩下的，到了高中再慢慢说吧。 5.13 中午12:45左右更：好好休息一下。 我等着。 哦还有，期末一定考好哦！ 万一初三真的按排名选座位呢。 相信你可以！ 5.13 晚上21:47左右更：我的宝开心就好。 有什么事儿叫我就成。 5.14 下午13:32左右更：看见了吗宝？ 这篇文章被我置顶了。 你的重要性不言而喻呀。 比起数学，你更让人期待呢。 5.14 晚上20:10左右更：今天下了小雨呢。 没法和宝贝儿走圈儿聊天了。 明天要是不下雨而且宝有空的话，一定来哦！ 5.16 晚上20:12左右更：我也没有这么厉害，十几分钟想把几道物理题写出来确实不太可能。。。 但宝贝儿让我做的事，我都会尽力的。 宝贝儿能理解的对吧？ 哦，还有。。。 你的小愿望我还记着呢，只不过现在这种情况不好付出行动了。 嗯。。。宝贝儿也别嫌我烦，但我只是想给你提一点小建议。 现在的什么数学、物理之类的科目，真到了考试的时候，难度也不是很大。 我觉得，宝贝儿应该在平时做题的时候就多想一想。虽然说有时你急着要个答案，我就写出来给你了。但是自己的思考真的更重要。 真的，物理题还好，毕竟现在的物理还没那么复杂。但有的数学题可能比较难想，比如你们那个补习班的题，虽说有点局限，但确实是难想出来。 这个时候，就是思考的机会了。思考出来之后的那一刻，那种快乐，是无与伦比的。 也许有时候你更想急着看到答案，特别是一些填空选择之类的，但思考的过程也很必要且有趣啊。 我看人家说，如果你拿一道奥赛题去问数竞生和数学家，那么数竞生可能凭着经验，不到 20s 就能给出答案。数学家不能，但给那些数学家两三天的时间之后，他们给出的答案比数竞生的答案要深刻得多。 宝贝儿也许有些烦我在这里讲大道理了，不过我也想你考试考好一点嘛（虽然我对考试所持的态度并不好）。毕竟在现在这个社会，考试也是迫不得已嘛。 宝贝儿不应该看着我的成绩抱怨自己，而应该试着跟上我的脚步嘛，生物考来考去就那几点嘛，数学考来考去就那些东西嘛。 上回老魏出的一道两种情况的一次函数的题，你不也做出来了吗，我还漏一种情况呢，你也不比我差嘛。 毕竟我的宝嘛，当然是很棒的！ 啊，不是讽刺，不是反话， 是发自内心的，真的真的，宝贝儿真的很棒！ 期末一定能考进年级前二十！ 那个蔡某某都能进前二十，我家宝有什么不能的？ 其他科目高分，语文碾压，指不定哪一天还要把我压下去呢！ 宝贝儿真的很棒！ 5.17 晚上19:20左右更：md 我竟然吃了我现同桌的醋。 她有事儿就说嘛，我什么都尽量做。 叫个名字然后又不说话了还一脸无奈是啥意思。 整得人有点。。。寒心。。。 感觉我被人不要了的那种。。。 对我说完没什么之后就找我旁边的。 c 我就说不该换这个座位。 换个稀烂。 当然，我对她肯定没什么意见，有意见也要么是我旁边的要么是我自己的。 额。。。不过她还提醒我把外套穿上。说什么别感冒了。 啊，挺感动的其实，至少知道她还想着我。 当然了像我这么好的人她肯定是会想着的（也许是我自作多情）。 嗯。。。我嘴是笨了点儿，不怎么会说话。 但是简单的“哦”“嗯”里面，也都是对她满满的情感啊。 啊。 啊。 好像没什么说的了。 不过不知不觉，这篇文章都写这么长了。 可以找个 rss 阅读器然后订阅我的网站哦。那样有更新应该就会提醒了。 哎呀，我好像为她什么也没干过，怎么面对她的笑呢。 好奇怪，看到她和其他男生说话就不舒服，看到她被其他男生逗笑心里就堵得慌，感觉自己真是没用。 好吧，只能一边听她的话一边和她说话了。 啊今天还没叫一声宝。 我在想你呢宝。 5.17 晚上21:50左右更：宝贝儿啊—— 我真的好想做回同桌啊—— 真的好想好想。。。 我相信会有那一天的！","categories":[{"name":"随笔","slug":"随笔","permalink":"https://example.com/categories/%E9%9A%8F%E7%AC%94/"}],"tags":[{"name":"我心里的人","slug":"我心里的人","permalink":"https://example.com/tags/%E6%88%91%E5%BF%83%E9%87%8C%E7%9A%84%E4%BA%BA/"}]},{"title":"函数的增、减、奇、偶性质分析","slug":"函数的增减奇偶","date":"2022-04-10T11:23:40.000Z","updated":"2022-05-08T02:02:38.175Z","comments":true,"path":"2022/04/10/han-shu-de-zeng-jian-qi-ou/","link":"","permalink":"https://example.com/2022/04/10/han-shu-de-zeng-jian-qi-ou/","excerpt":"一、增函数与减函数1.基本定义 设函数 的定义域为 ，当取 中某区间上任意自变量 ，都有 ，就说 是该区间上的增函数，也可以说 在该区间上单调递增。 同样的，若取 中某区间上任意自变量 ，都有 ，就说 是该区间上的减函数，也可以说 在该区间上单调递减。","text":"一、增函数与减函数1.基本定义 设函数 的定义域为 ，当取 中某区间上任意自变量 ，都有 ，就说 是该区间上的增函数，也可以说 在该区间上单调递增。 同样的，若取 中某区间上任意自变量 ，都有 ，就说 是该区间上的减函数，也可以说 在该区间上单调递减。 如上，（1）图为增函数，（2）图为减函数。 判断一个已知函数是增函数还是减函数，只需求其斜率即可。例如一次函数 中的 ，之前我就有过疑问，问了数学老师为什么用 不用 。现在知道了， 更好地表达出了该函数的斜率。可以尝试在 中给定一个变量 ，然后输入一个函数 ，打开动画让 值变化，观察函数图像的变化。 不难发现， 时，正比例函数 与 轴重合。 时，该函数为增函数；反之， 时，该函数为减函数。 由正比例函数这种的特殊情况，我们可以考虑更复杂的函数的增减。如二次函数 ，很容易能看出来该函数对称轴为 。且二次项的系数是正数，可知函数图像开口向上。则易得该函数 在区间 上单调递减，而在区间 上单调递增。如下图。 2.斜率斜率，顾名思义，就是函数的倾斜程度。它也能反映函数的增减情况。斜率实际上就是 坐标与 坐标差值的比值。 如函数 ，求其斜率应这样做： 设函数定义域为 ，取 。若 ， 则 斜率大于 0，该函数为增函数。 一般来说，设一个函数斜率为 ， ，函数为增； ，函数为减。 读者可尝试对上文二次函数 对称轴左右的区间进行斜率求值并分析增减。 二、奇函数与偶函数1.基本定义我们假设 和 都在函数 的定义域 中，若有 f(-x)=f(x)我们说该函数为偶函数。 同样，若 f(-x)=-f(x)则称该函数为奇函数。 偶函数关于 y 轴对称，奇函数关于原点对称。 如图，紫色线为函数 的图像，该函数为偶函数；红色线为函数 的图像，该函数为奇函数。 2.应用可以想象，奇函数 在 和在 时单调性相同。反之，偶函数 和在 时单调性相反。 例如，我们可以利用研究偶函数对称性的方法证明二次函数的对称轴。 我们来试着求证：二次函数 的图像关于 对称。 首先我们要知道，想求证该函数关于某条直线对称，其实就是求证该函数上关于此直线对称的任意两点对应的函数值相等。 我们可以任取 ，分别求关于 对称的两点的函数值。 这两点为： ， 。 这两点对应的函数值便可以求出来： so, ，说明函数图像关于 对称。 三、函数性质分析这里只探讨函数的增、减、奇、偶性质。 以我的个人经验，应先分析函数奇偶性，在分析其增减。分段函数另当别论，因为它的图像有时并不规则，I mean，图像可能是这样： 所以分段函数应在各个区间内进行性质分析。 一般的比较规则的函数图像可先探讨奇偶，再探讨单调性。 如当你已证 为偶函数时，可迅速知道该函数在区间 上为单调递减，在区间 上单调递增。 四、本文结语本文介绍了函数的单调性、函数的奇偶性，并简略地分享了一下作者本人探究函数性质时的一般顺序。 作者才初二，各位大佬别要求太高，只是一些个人拙见而已。","categories":[{"name":"数学","slug":"数学","permalink":"https://example.com/categories/%E6%95%B0%E5%AD%A6/"}],"tags":[{"name":"函数","slug":"函数","permalink":"https://example.com/tags/%E5%87%BD%E6%95%B0/"},{"name":"高中必修一","slug":"高中必修一","permalink":"https://example.com/tags/%E9%AB%98%E4%B8%AD%E5%BF%85%E4%BF%AE%E4%B8%80/"}]},{"title":"此博客诞生前的究极大坑","slug":"博客诞生之初的究极大坑","date":"2022-04-10T05:04:21.000Z","updated":"2022-05-03T04:57:37.558Z","comments":true,"path":"2022/04/10/bo-ke-dan-sheng-zhi-chu-de-jiu-ji-da-keng/","link":"","permalink":"https://example.com/2022/04/10/bo-ke-dan-sheng-zhi-chu-de-jiu-ji-da-keng/","excerpt":"","text":"我的数学博客建好了，我也不打算加什么花里胡哨的东西了。 但在这个博客正常运行前，我踩了个超级大坑，自己都觉得好笑。 我一直部署，却发现 public 文件夹里没有 index.html 。 后来还查了半天资料才发现，我把博客初始化时自带的 hello_world 文章删掉了！ 没有文章是不能完整生成静态文件的！ 这个问题耽误了我好长时间。。。 我觉悟的地方：https://www.zhihu.com/question/35964327","categories":[{"name":"随笔","slug":"随笔","permalink":"https://example.com/categories/%E9%9A%8F%E7%AC%94/"}],"tags":[{"name":"blog","slug":"blog","permalink":"https://example.com/tags/blog/"}]},{"title":"Markdown 基础语法","slug":"Markdown基础语法","date":"2022-01-29T05:23:07.000Z","updated":"2022-05-15T06:28:50.194Z","comments":true,"path":"2022/01/29/markdown-ji-chu-yu-fa/","link":"","permalink":"https://example.com/2022/01/29/markdown-ji-chu-yu-fa/","excerpt":"声明：这是篇今年 1 月 29 日写的老文章了。从之前的废掉的博客搬过来的。留个纪念。 众所周知， Markdown 是一个专用于写博客的语言， Markdown 文件后缀为 .md。它的语法很简单，本篇文章就结合网上的资料向大家介绍一下。","text":"声明：这是篇今年 1 月 29 日写的老文章了。从之前的废掉的博客搬过来的。留个纪念。 众所周知， Markdown 是一个专用于写博客的语言， Markdown 文件后缀为 .md。它的语法很简单，本篇文章就结合网上的资料向大家介绍一下。 标题标题分六级，分别用对应数量的#字标识。 一级标题如上所示 ↑ 输入： ## 二级标题 ### 三级标题 #### 四级标题 以上输入分别可以输出二级、三级、四级标题。 五级六级以此类推。注意，#字后有一个空格。如果你想在你的md文件中直接展示语法（如上文我写的“输入”），只需在#号前添加反斜杠‘\\’即可，如“\\#”。 段落段落在Markdown中很简单，只是要注意不要在段落开始空格或缩进（除非在列表中，列表后面会讲），段落与段落中间有空行。 输入： This is the first paragraph. （空行） This is the second paragraph. 输出： This is the first paragraph. This is the second paragraph. 换行语法是先在一行末尾打两个空格，再按下回车。 输入： First line.[blank][blank][enter]Second line. 输出： First line.Second line. 粗体与斜体粗体只需在文本两侧分别添加上没有空格的 ** 或 __ (两道下划线）即可，斜体只需一个 * 或 _ 即可。 输入： **Bold text** __Bold text__ *Italic text* _Italic text_ ***Important text*** **_Important text_** 输出： Bold text Bold text Italic text _Italic text_ Important text _Important text_ 只要符合粗体或斜体语法，任意组合均可。 区块引用区块引用前文用到过，输入输出都用的这个。只需‘&gt;’符号即可，但‘>’后有一个空格。 输入： > haha > hahaha > hahahaha 输出： haha hahaha hahahaha 还有嵌套用法：输入： > haha >&gt; hahaha 输出： haha hahaha 如果你担心兼容性，可在区块前后放置空行。 列表无序列表无序列表只需在每行前放置 ‘ + ’ 或 ‘ - ’ 或 ‘ * ’ 即可。 输入： + First item + Second item ​ Another paragraph（只需在段落开头缩进） + Third item 输出： First item Second item ​ Another paragraph Third item 有序列表有序列表只需两个条件： 每行由数字和句点开头 第一行数字为1 上面就是一个有序列表。 所以这样的输入： 1. ha3. hahaha2. haha 也能输出一个有序列表： ha hahaha haha CodeBlock（代码块）我最爱的代码块终于来了。 谈代码块之前，先说一下代码，只需用反单引号括起来即可（注意输入法要调英语才有反单引号，如这样的：`） 输入：`hexo -v` 输出：hexo -v 代码块只需用三个反单引号（ ``` ）或三个波浪线（ ~~~ ）括起来即可。 如输入： ```python（这里指定语言，用于显示语法高亮） print(“Hello world.”) ``` 则输出： 1print(&quot;Hello world.&quot;) 水平分割线这个很简单，只需用 *** 或 --- 或 ___ （数量为三个或三个以上）。 三个效果相同，就像这样： 链接想插入链接，只需先用 [ ] 将需要显示的文本括起来，再用 ( ) 把文本去到的链接括起来即可。还可在 url 后面用双引号括上一段文字，作为鼠标悬浮在文本上时的提示文本。 输入： [不懂的问度娘](https://baidu.com \\”这儿是百度，不懂就去搜啊\\”) 输出： 不懂的问度娘 如果你只是单纯想把 URLs 或 E-mail Addresses 转化成链接，请用尖括号将其括起来。 如输入： \\ 输出： 之前说到的文本格式符都能运用到链接上，如输入： **[不懂的问度娘](https://baidu.com \\”这儿是百度，不懂就去搜啊\\”)** 则输出： 不懂的问度娘 图片首先输入一个叹号“！”然后用中括号[]将加载时要显示的文本括起来，最后用小括号()将图片地址与鼠标悬浮在图片上时显示的文本括起来。 什么？我为什么不写输入输出示例？ 主要是。。。我没好看的图。。。 结束语 &amp; 总结so ，以上就是 Markdown 的基础语法讲解。想学更多可以去 Markdown Guide 了解。 其实现在有很多 Markdown 编辑器， Typora 就是其中之一。许多语法其实编辑器都不在意了，包括换行、图片的插入等，编辑器都已经配好了相关的功能。以后，写 Markdown 一定会就像普通地写文章一样简单，点点菜单栏的事儿嘛。 不过像我们这种“小佬”，还是更愿意开着 vscode 写源码。","categories":[{"name":"技术","slug":"技术","permalink":"https://example.com/categories/%E6%8A%80%E6%9C%AF/"}],"tags":[{"name":"Markdown","slug":"Markdown","permalink":"https://example.com/tags/Markdown/"},{"name":"blog","slug":"blog","permalink":"https://example.com/tags/blog/"}]}],"categories":[{"name":"数学","slug":"数学","permalink":"https://example.com/categories/%E6%95%B0%E5%AD%A6/"},{"name":"随笔","slug":"随笔","permalink":"https://example.com/categories/%E9%9A%8F%E7%AC%94/"},{"name":"技术","slug":"技术","permalink":"https://example.com/categories/%E6%8A%80%E6%9C%AF/"}],"tags":[{"name":"函数","slug":"函数","permalink":"https://example.com/tags/%E5%87%BD%E6%95%B0/"},{"name":"初中","slug":"初中","permalink":"https://example.com/tags/%E5%88%9D%E4%B8%AD/"},{"name":"我心里的人","slug":"我心里的人","permalink":"https://example.com/tags/%E6%88%91%E5%BF%83%E9%87%8C%E7%9A%84%E4%BA%BA/"},{"name":"高中必修一","slug":"高中必修一","permalink":"https://example.com/tags/%E9%AB%98%E4%B8%AD%E5%BF%85%E4%BF%AE%E4%B8%80/"},{"name":"blog","slug":"blog","permalink":"https://example.com/tags/blog/"},{"name":"Markdown","slug":"Markdown","permalink":"https://example.com/tags/Markdown/"}]}